Revit 2027 API
FabricRoundingManager.ApplicableTotalLengthRoundingMethod Property
 The applicable rounding method for Cut Overall Length and Cut Overall Width parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoundingMethod ApplicableTotalLengthRoundingMethod { get; }
Public ReadOnly Property ApplicableTotalLengthRoundingMethod As RoundingMethod
	Get
public:
property RoundingMethod ApplicableTotalLengthRoundingMethod {
	RoundingMethod get ();
}
member ApplicableTotalLengthRoundingMethod : RoundingMethod with get
Property Value
RoundingMethod
Remarks
 IsActiveOnElement property of ReinforcementSettings FabricRoundingManager has to be true. ApplicableTotalLengthRoundingMethod is meaningless if ReinforcementSettings FabricRoundingManager IsActiveOnElement is false.
See Also
Reference
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace